
export let MockDataDiaLogAEAI = [
    {"id":"1", "content":"您好，请点击.",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"2","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"3","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"4","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"5","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"6","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"7","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"8", "content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"9","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"10","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"11","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"12","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"13","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"},
    {"id":"14","content":"您好，请点击需要咨询的业务类别，为您提供专属客服：\n1. 聊天功能\n2. 打卡审批\n3. 客户联系\n4. 家校沟通\n5. 应用与管理端\n6. 认证验证\n7. 帐号与通讯录\n8. 硬件与API\n9. 发消息/登录/加好友等异常\n10. 高级功能购买/续费/发票/合同\n11. 其他咨询",
        "completed_at":"2022-12-09T14:44:53.819000+08:00"}
]

export interface WRBaseData {
    id:string;
    content: string;
    completed_at: string;
}

export interface WRData extends WRBaseData {
    completed:boolean;
    type:string;
    typeStr:string;
}

export const random = (min:any,max:any) => Math.floor(Math.random() * (max - min + 1) + min)
